testCase/0/Df
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (1e+05 0 0 0 1e+05 0 0 0 1e+05);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
}


// ************************************************************************* //
