testCase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include "../0/include"

defaultFieldValues
(
    volScalarFieldValue porosityF 1 
    volScalarFieldValue Ts 273
    //volTensorFieldValue	Df 0
);

regions
(
    zoneToCell
    {
        name porousBlockage;
        fieldValues
        (
            volScalarFieldValue porosityF 0 
	    volScalarFieldValue Ts 1000
        );
    }
);


// ************************************************************************* //
